import '@/app/(pages)/confidential/styles/confidential.css';

function ConfidentialPage() {
    return (
        <div className="confidential">
            <div className="confidential__title">
                <h1 className="confidendial__title-h1">Политика в отношении обработки персональный данных</h1>
            </div>
            <div className="confidential__text">
                <p className="confidential__text-p--big">
                    &nbsp;&nbsp;&nbsp;Настоящая Политика в отношении обработки персональный данных (далее – «Политика»)
                    подготовлена в соответствии с Федеральным законом Российской Федерации «О персональных данных» N
                    152-ФЗ от 27 июля 2006 года (далее – «152-ФЗ») и определяет позицию администрации сайта robivox.ru
                    (далее – «Администрация сайта») в области обработки и защиты персональных данных, соблюдения прав и
                    свобод каждого человека и, в особенности, права на неприкосновенность частной жизни, личную и
                    семейную тайну.
                </p>
                <p className="confidential__text-p--big">
                    &nbsp;&nbsp;&nbsp;Настоящая Политика применяется по отношению ко всем персональным данным (далее –
                    «ПД») которые мы собираем или получаем онлайн, включая ПД, собранные или предоставленную через наш
                    веб-сайт («Веб-сайт») и любые мобильные сайты, приложения, виджеты и прочие интерактивные мобильные
                    функции (совместно именуемые как наши «Приложения»), на наших страницах в социальных медиа,
                    управляемых нами («Страницы в Социальных Медиа»), а также с помощью электронных писем в формате
                    HTML, которые мы Вам отправляем (включая Страницы в Социальных Медиа, Приложения и Веб-сайты,
                    совместно именуемые «Сайты»). Посещая наши Сайты, Вы принимаете и соглашаетесь с правилами,
                    описанными в данной Политике. Если Вы не согласны с какими-либо условиями данной Политики,
                    пожалуйста, не пользуйтесь Сайтами или не предоставляйте никаких Данных.
                </p>
                <ol className="confidential__text-ol">
                    <li>Персональные данные.</li>
                    <p className="confidential__text-p--small">
                        &nbsp;&nbsp;&nbsp;Персональные данные – это любая информация, относящаяся к прямо или косвенно
                        определенному или определяемому физическому лицу.
                    </p>
                    <p className="confidential__text-p--small">
                        &nbsp;&nbsp;&nbsp;Сбор ПД осуществляется через Сайты, например, когда Вы подписываетесь на
                        новостную рассылку, заказываете услуги или совершаете какую-либо покупку.
                    </p>
                    <p className="confidential__text-p--small">
                        &nbsp;&nbsp;&nbsp;Помимо ваших Персональных данных мы можем получать дополнительную информацию
                        следующими средствами:
                    </p>
                    <ul className="confidential__text-ul">
                        <li>
                            Через Ваш браузер или устройство: Определенная информация собирается большинством браузеров
                            или автоматически через Ваше устройство. Мы используем данную информацию в целях статистики,
                            а также чтобы убедиться, что Сайты работают правильно.
                        </li>
                        <li>
                            Через лог-файлы сервера: Ваш «IP адрес» – это номер, который автоматически приписывается
                            Вашему компьютеру или устройству, с помощью которых вы выходите в Интернет через Вашего
                            провайдера. IP адрес идентифицируется и записывается автоматически в лог-файлах нашего
                            сервера всегда, когда Вы посещаете Сайты, также как и время посещения и посещенные страницы.
                        </li>
                        <li>
                            При использовании куки-файлов: Куки-файлы позволяют веб-серверу переносить данные на
                            компьютер либо на устройство для ведения протокола и других целей. Если Вы хотите
                            заблокировать нашу возможность получать Вашу информацию с помощью куки-файлов, Вы можете
                            изменить настройки Вашего веб-браузера, что позволит Вам принимать либо блокировать
                            куки-файлы.
                        </li>
                    </ul>
                    <br />
                    <p className="confidential__text-p--small">
                        &nbsp;&nbsp;&nbsp;Мы можем использовать Персональные данные в следующих целях:
                    </p>
                    <ul className="confidential__text-ul">
                        <li>
                            Для выполнения условий соглашения стороной которого, выгодоприобретателем или поручителем,
                            по которому являетесь Вы.
                        </li>
                        <li>Чтобы отвечать на Ваши запросы и комментарии и выполнять Ваши заявки.</li>
                        <li>
                            Чтобы отправлять Вам административную информацию, например, информацию в отношении Сайтов и
                            изменений наших условий и правил.
                        </li>
                        <li>Чтобы обработать Ваши платежи.</li>
                        <li>
                            Чтобы Вы могли пользоваться чатом, страницами профилей, блогами и прочими услугами, в рамках
                            которых Вы можете размещать информацию и материалы (включая наши Страницы в Социальных
                            Медиа).
                        </li>
                        <li>
                            В целях нашей деятельности, таких как анализирование и управление нашей деятельностью,
                            исследование рынка, разработка новых продуктов, расширение наших Сайтов, улучшение наших
                            услуг и продуктов, идентификация тенденций в использовании, определение эффективности наших
                            рекламных акций, улучшение интерфейса и контента Сайтов на основе совершенных Вами действий
                            на Сайтах, оценка удовлетворенности пользователей и предоставление потребительских услуг
                            (включая устранение неполадок у пользователя).
                        </li>
                        <li>
                            Мы используем информацию, полученную браузерами или Вашим устройством, для целей статистики,
                            а также чтобы убедиться, что Сайты функционируют должным образом.
                        </li>
                    </ul>
                    <li>Безопасность</li>
                    <p className="confidential__text-p--small">
                        &nbsp;&nbsp;&nbsp;Передача персональных данных, в т.ч. и трансграничная, Администрацией сайта не
                        осуществляется. Администрация сайта является ответственным за обеспечение безопасности ПД.
                    </p>
                    <p className="confidential__text-p--small">
                        &nbsp;&nbsp;&nbsp;При обработке ПД мы принимаем необходимые правовые, организационные и
                        технические меры для защиты ПД от неправомерного или случайного доступа к ним, уничтожения,
                        изменения, блокирования, копирования, предоставления, распространения ПД, а также от иных
                        неправомерных действий в отношении ПД.
                    </p>
                    <p className="confidential__text-p--small">
                        &nbsp;&nbsp;&nbsp;Если у Вас есть опасения, что безопасность нашей с Вами коммуникации нарушена
                        (например, если Вам кажется, что безопасность любого вашего аккаунта в нашей системе под
                        угрозой), пожалуйста, незамедлительно сообщите нам о проблеме.
                    </p>
                    <li>Права и обязанности субъектов ПД, а также Администрации сайта в части обработки ПД</li>
                    <p className="confidential__text-p--small">Клиент имеет право получить от Администрации сайта:</p>
                    <ul className="confidential__text-ul">
                        <li>
                            подтверждение факта обработки ПД и сведения о наличии ПД, относящихся к соответствующему
                            субъекту ПД;
                        </li>
                        <li>сведения о правовых основаниях и целях обработки ПД;</li>
                        <li>сведения о применяемых способах обработки ПД;</li>
                        <li>сведения о наименовании и местонахождении ИП;</li>
                        <li>
                            перечень обрабатываемых ПД, относящихся к субъекту ПД, и информацию об источнике их
                            получения, если иной порядок предоставления таких ПД не предусмотрен федеральными законами;
                        </li>
                        <li>сведения о сроках обработки ПД, в том числе о сроках их хранения;</li>
                        <li>сведения о порядке осуществления субъектом ПД прав, предусмотренных 152-ФЗ;</li>
                        <li>
                            иные сведения, предусмотренные 152-ФЗ или другими нормативно-правовыми актами Российской
                            Федерации;
                        </li>
                    </ul>
                    <p className="confidential__text-p--small">
                        Клиент имеет право потребовать от Администрации сайта:
                    </p>
                    <ul className="confidential__text-ul">
                        <li>
                            уточнения своих ПД, их блокирования или уничтожения в случае, если ПД являются неполными,
                            устаревшими, неточными, незаконно полученными или не являются необходимыми для заявленной
                            цели обработки;
                        </li>
                        <li>отозвать свое согласие на обработку ПД;</li>
                        <li>требовать устранения неправомерных действий Администрации сайта в отношении его ПД;</li>
                        <li>
                            обжаловать действия или бездействие Администрации сайта в Роскомнадзор или в судебном
                            порядке в случае, если субъект ПД считает, что Администрация сайта осуществляет обработку
                            его ПД с нарушением требований законодательства или иным образом нарушает его права и
                            свободы;
                        </li>
                    </ul>
                    <li>Сайты третьих лиц</li>
                    <p className="confidential__text-p--small">
                        &nbsp;&nbsp;&nbsp;В настоящей Политике мы не рассматриваем и не несем ответственности за
                        конфиденциальность, информацию или другие аспекты деятельности любых третьих лиц, включая любое
                        третье лицо, управляющее любым сайтом, ссылка на который содержится на сайтах Администрации
                        сайта. Наличие ссылки на сайтах Администрации сайта не подразумевает поддержку нами или нашими
                        дочерними компаниями сайта, на который ведет ссылка.
                    </p>
                    <p className="confidential__text-p--small">
                        &nbsp;&nbsp;&nbsp;Мы также не несем ответственности за сбор, использование и разглашение
                        политики и практики (включая политику безопасности данных) других организаций, таких, как
                        Facebook, Apple, Google, Microsoft, RIM и любого другого разработчика приложений, поставщика
                        приложений, поставщика платформ социальных медиа, поставщика операционной системы, поставщика
                        беспроводной сети или производителя устройства, включая Персональные данные, разглашаемые Вами
                        другим организациям посредством или с использованием Приложений или наших Страниц в Социальных
                        Медиа.
                    </p>
                    <li>Срок хранения</li>
                    <p className="confidential__text-p--small">Мы будем хранить Ваши ПД, до:</p>
                    <ul className="confidential__text-ul">
                        <li>достижения целей обработки Ваших ПД;</li>
                        <li>
                            выполнения условий соглашения, стороной которого, выгодоприобретателем или поручителем, по
                            которому являетесь Вы;
                        </li>
                        <li>окончания срока разрешения на обработку ПД.</li>
                    </ul>
                    <li>Сайты третьих лиц</li>
                    <p className="confidential__text-p--big">
                        &nbsp;&nbsp;&nbsp;Если Ваш возраст меньше 18 лет, Вам необходимо ознакомиться с условиями
                        настоящей Политики вместе с Вашим законным представителем (родителем или опекуном), чтобы
                        удостовериться, что Вы оба понимаете ее суть. Несмотря на то, что определение возраста наших
                        пользователей не входит в наши обязанности, мы можем производить верификационные проверки. Если
                        нам станет известно, что мы собирали информацию лица, не достигнувшего 18-летнего возраста, без
                        согласия родителей, мы удалим такую информацию в кратчайшие сроки и можем заблокировать доступ
                        такого лица к применимому сайту в сети Интернет.
                    </p>
                    <li>Специальная категория ПД</li>
                    <p className="confidential__text-p--big">
                        &nbsp;&nbsp;&nbsp;Мы просим Вас не указывать и не разглашать Персональные Данные относящиеся к
                        специальной категории (касающихся расовой, национальной принадлежности, политических взглядов,
                        религиозных или философских убеждений, состояния здоровья, интимной жизни) на Сайтах или
                        каким-либо другим способом.
                    </p>
                    <li>Дополнения к настоящей Политике</li>
                    <p className="confidential__text-p--small">
                        &nbsp;&nbsp;&nbsp;Настоящая Политика является локальным нормативным документом Администрации
                        сайта и хранится в бумажном виде по адресу местонахождения Администрации сайта.
                    </p>
                    <p className="confidential__text-p--small">
                        &nbsp;&nbsp;&nbsp;Мы можем изменить настоящую Политику. Настоящая Политика может быть
                        пересмотрена в любом из следующих случаев:
                    </p>
                    <ul className="confidential__text-ul">
                        <li>при изменении законодательства Российской Федерации в области обработки и защиты ПД;</li>
                        <li>
                            в случаях получения предписаний на устранение несоответствий, затрагивающих область действия
                            Политики;
                        </li>
                        <li>по решению Администрации сайта;</li>
                        <li>при изменении целей обработки ПД;</li>
                        <li>
                            при изменении организационной структуры, структуры информационных и/или телекоммуникационных
                            систем (или введении новых);
                        </li>
                        <li>при применении новых технологий обработки ПД (в т.ч. передачи, хранения);</li>
                        <li>
                            при появлении необходимости в изменении процесса обработки ПД, связанной с деятельностью
                            Администрации сайта.
                        </li>
                    </ul>
                    <p className="confidential__text-p--big">
                        &nbsp;&nbsp;&nbsp;Любые изменения в настоящей Политике вступят силу с момента публикации
                        настоящей Политики на Сайте. Использование Вами Сайтов после таких изменений означает, что Вы
                        принимаете измененную Политику.
                    </p>
                </ol>
            </div>
        </div>
    );
}

export default ConfidentialPage;
